CHOSE_BUTTON_MESSAGE = "Выбери опцию на клавиатуре:\n\n"

MENU_MESSAGE = "*Меню:*"

HELP_MENU_MESSAGE = "Чтобы добавить новый опрос, нажми на кнопку \"Добавить опрос\"\n" \
                    "Чтобы посмотреть свои опросы и информацию по ним, нажми \"Мои опросы\"\n" \

HELLO_MESSAGE = "Привет я бот по созданию опросов!"

CHOSE_POLL_MESSAGE = "Выбери опрос, по которому Вы хотите увитеть информацию"

EMPTY_TEXT = "Не найден текст в сообщении\n\n"

HOW_DID_USER_KNOW_MESSAGE = "Можешь рассказать, где ты обо мне узнал? " \
                            "Это не обязательный пункт, так что можешь пропустить, если хочешь"

ALMOST_READY_MESSAGE = "Спасибо за ответ!"

HELP_MESSAGE = "Да тут же всё просто\n\n"

# Buttons

BACK_BUTTON = ["Назад"]
INPUT_BUTTONS = [["Помощь", "Назад"]]

MAIN_MENU_BUTTONS = ["Добавить опрос", "Мои опросы", ["Помогите"]]

HOW_DID_USER_KNOW_BUTTONS = [
    ("Увидел у других", "saw_others"), [("От друзей", "friends"), "Instagram"], ["Telegram", ("Другое", "other")]
]
